CREATE TABLE shop.client
(
    client_id   integer                  NOT NULL
        CONSTRAINT pk_client
            PRIMARY KEY,
    name        varchar(30)              NOT NULL,
    phone       varchar(11)
        CONSTRAINT uq_client_phone
            UNIQUE,
    dt          timestamp WITH TIME ZONE NOT NULL,
    ch_employee integer                  NOT NULL
);

INSERT INTO shop.client (client_id, name, phone, dt, ch_employee)
VALUES (1, 'Иванов Иван', '12345678901', '2023-09-11 10:00:00', 101),
       (2, 'Петров Петр', '23456789012', '2023-09-11 11:00:00', 102),
       (3, 'Сидоров Сидор', '34567890123', '2023-09-11 12:00:00', 103),
       (4, 'Андреев Андрей', '45678901234', '2023-09-11 13:00:00', 104),
       (5, 'Николаев Николай', '56789012345', '2023-09-11 14:00:00', 105),
       (6, 'Олегов Олег', '67890123456', '2023-09-11 15:00:00', 106),
       (7, 'Татьянова Татьяна', '78901234567', '2023-09-11 16:00:00', 107),
       (8, 'Елена Еленова', '89012345678', '2023-09-11 17:00:00', 108),
       (9, 'Дмитриев Дмитрий', '90123456789', '2023-09-11 18:00:00', 109),
       (10, 'Светлана Светланова', '01234567890', '2023-09-11 19:00:00', 110);